from pymongo import MongoClient

client = MongoClient('localhost', 27017)
db = client.market_dev

# 定义父子标签字典
totalTags = {
    '学习': [
        '经济/管理', '计算机', '互联网',
        '数学/统计', '生物', '电信', '法学',
        '文学/新闻传播', '美术', '民族学',
        '外语', '化学', '药学', '体育', '音乐'
        ],
    '生活/服务': [
        '约拍', '电脑维修', '手机维修', '保洁',
        '租赁', '游戏', '娱乐/电影', '热水袋',
        '伞', '摆件', '代取', '搬送', '清洁用品'
        ],
    '图书': ['教材', '考研', '托福', 'GRE', '文艺', '人文社科', '励志', '教育', '证书', '四六级'],
    '数码/电子': [
        '手机/手机配件', '电脑/电脑配件', '相机/摄像机',
        'MP3/MP4/录音笔', '游戏机', 'U盘', '硬盘',
        '闪存卡', '电风扇', '台灯'
        ],
    '宿舍': [
        '盆', '瑜伽垫', '拉杆箱', '座椅',
        '上铺神器', '床边篮', '鞋架', '床帘',
        '书桌', '零食', '拖把', '背包', '秤', '储物工具'
        ],
    '文体': [
        '文具', '记事本', '乐器', '球类', '篮球',
        '足球', '羽毛球', '乒乓球', '网球', '棋盘', '健身器材'
        ],
    '校园代步': ['自行车', '轮滑', '火星车', '滑板', '骑行配件'],
    '服装': ['男装', '女装', '女鞋', '男鞋', '帽子'],
    '品牌': [
        '苹果', '安卓', '魅族', '小米', '三星',
        '锤子', '华为', '联想', 'HTC', '努比亚', 'Nexus',
        '乐视', '中兴', 'IUNI', 'OPPO', 'Vivo', 'MOTO', '黑莓'
        ],
    '其他': []
}
# 插入父标签和子标签列表
db.totalTags.insert_one(totalTags).inserted_id
# 数据库插入
db.users.insert_one({}).inserted_id
db.goods.insert_one({}).inserted_id
db.tags.insert_one({}).inserted_id
